IsValidViewScale Method
 This validator checks that the view scale is in the allowable range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static bool IsValidViewScale(
	int viewScale
)
Visual Basic
Public Shared Function IsValidViewScale ( _
	viewScale As Integer _
) As Boolean
Visual C++
public:
static bool IsValidViewScale(
	int viewScale
)
Parameters
viewScale
Type: SystemInt32
 The denominator X in the view scale 1/X.
Return Value
 True if the view scale is within the allowable range, false otherwise.
Remarks
 The view scale is expressed as 1/X, where X is an integer the range 1 to 24,000.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →